#!/bin/bash
clear

# CORES
RED='\033[38;5;196m'
NEG='\033[1m'
NC='\033[0m'
###################################################

if [ "$1" == "" ]
then
        echo -e "${NEG}Informe o dominio ${NC}"
        echo -e "${NEG}Exemplo: $0 teste.com.br ${NC}"
else
       echo -e "${RED}
 ██████╗███████╗███████╗    ██╗      █████╗ ██████╗ ███████╗
██╔════╝██╔════╝██╔════╝    ██║     ██╔══██╗██╔══██╗██╔════╝
██║     ███████╗█████╗      ██║     ███████║██████╔╝███████╗
██║     ╚════██║██╔══╝      ██║     ██╔══██║██╔══██╗╚════██║
╚██████╗███████║██║         ███████╗██║  ██║██████╔╝███████║
 ╚═════╝╚══════╝╚═╝         ╚══════╝╚═╝  ╚═╝╚═════╝ ╚══════╝
 ${NC}"
echo

jwt=$(curl -s --user ${UMBRELLA_TOKEN} --request POST --url 'https://api.umbrella.com/auth/v2/token' \
-H 'Content-Type: application/x-www-form-urlencoded' \
-d 'grant_type=client_credentials' | jq | grep  "access_token" | awk -F '"' '{print $4}')

if [ -z  $jwt ]
then
        echo -e "${NEG}Credencial incorreta ou expirada, tente novamente! ${NC}"
        exit
else
curl -s "https://api.umbrella.com/investigate/v2/subdomains/$1?limit=1000000000" -H "Authorization: Bearer $jwt" | jq | grep "name" | awk -F '"' '{print $4}' | sort -u
fi
fi
